In [7]:
import pandas as pd
import datetime as dt
from pandas_datareader import data

ModuleNotFoundError: No module named 'pandas_datareader'

# REVIEW OF DATETIME FUNCTIONS

In [25]:
dt.date(2010,4,13)

datetime.date(2010, 4, 13)

In [26]:
someday=dt.date(2010,4,13)

In [32]:
print(someday.year)
print(someday.month)
print(someday.day)

2010
4
13

In [29]:
someday=dt.datetime(2010,4,13,8,13,59)

In [31]:
print(someday.hour)
print(someday.minute)
print(someday.second)

8
13
59

In [16]:
str(dt.datetime(2010,4,13,8,13,59))

'2010-04-13 08:13:59'

# The pandas Timestamp object

Tmestamp() object is the string object.

In [58]:
pd.Timestamp("2015-03-31")
pd.Timestamp("2015/03/31")
pd.Timestamp("2015, 03, 31")
pd.Timestamp("1/1/11")
pd.Timestamp("20-12-25")
pd.Timestamp("20/12/25")
pd.Timestamp("20, 12, 25")
pd.Timestamp("20-12-25 08:03:59 PM")
pd.Timestamp("20-12-25 08:03:59 AM")

Timestamp('2025-12-20 08:03:59')

In [65]:
pd.Timestamp(dt.date(2015, 1, 1))

Timestamp('2015-01-01 00:00:00')

In [69]:
pd.Timestamp(dt.datetime(2015, 1, 1, 22, 13, 29))

Timestamp('2015-01-01 22:13:29')

# The pandas DateTime object

This takes the list of dates as strings in the manner of "YY MM DD (or) DD MM YY" and converts them into pandas timeStamp to perform panda series and method operations

In [79]:
dates=["2016-12-12", "2015/12/15", "2015-12-14"]
print(pd.DatetimeIndex(dates))
#first makes the Strings into pandas time stampa dn stores in object
print(type(pd.DatetimeIndex(dates)))

DatetimeIndex(['2016-12-12', '2015-12-15', '2015-12-14'], dtype='datetime64[ns]', freq=None)
<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [84]:
dates=[dt.date(2016,1,10), dt.date(2016,10,11), dt.date(2016,11,10)]
dtIndex=pd.DatetimeIndex(dates)
pd.DatetimeIndex(dates)

In [86]:
values=[100,200,123]
pd.Series(data=values,index=dtIndex)
#creates a series which has the given list as values and their indexes are DateTimeindexes in above cell.

2016-01-10    100
2016-10-11    200
2016-11-10    123
dtype: int64

# THE pd.to_datetime() Method

This will accept an input of a string or a list of strings or a python Date object or a python date time object and they can convert it to time stamp

The pd.to_datetime() is functionable only  if we give accurate date and time format.

In application this is used to convert pandas objects into Time stamps.

In [90]:
pd.to_datetime("2001-02-11")
pd.to_datetime(dt.date(2001, 2, 11))
pd.to_datetime(dt.datetime(2001, 2, 11, 11, 11, 11))
pd.to_datetime(["2001-02-11","2001-12-01","2001-02-01","June 5th, 2001"])

DatetimeIndex(['2001-02-11', '2001-12-01', '2001-02-01', '2001-06-05'], dtype='datetime64[ns]', freq=None)

In [92]:
times=pd.Series(["2001-02-11","2001-12-01","2001-02-01","June 5th, 2001"])
times

0        2001-02-11
1        2001-12-01
2        2001-02-01
3    June 5th, 2001
dtype: object

In [93]:
pd.to_datetime(times)

0   2001-02-11
1   2001-12-01
2   2001-02-01
3   2001-06-05
dtype: datetime64[ns]

In [96]:
datess=pd.Series(["July 5th, 1996", "10/04/1991", "Hello", "2015-02-31"])
datess
#this makes any list as series.

0    July 5th, 1996
1        10/04/1991
2             Hello
3        2015-02-31
dtype: object

In [99]:
#pd.to_datetime(datess) -->erroe becuasue no corrct date and time in all values of list.
pd.to_datetime(datess, errors="coerce")
#this makes the errors values as the NAT values.

0   1996-07-05
1   1991-10-04
2          NaT
3          NaT
dtype: datetime64[ns]

In [103]:
pd.to_datetime([1325698745,1325698755,1325698746,1325698747,1325698744])
# thsi counts from zero and gives the date and time(timestamp) at that particular given list of numbers.

DatetimeIndex(['1970-01-01 00:00:01.325698745',
               '1970-01-01 00:00:01.325698755',
               '1970-01-01 00:00:01.325698746',
               '1970-01-01 00:00:01.325698747',
               '1970-01-01 00:00:01.325698744'],
              dtype='datetime64[ns]', freq=None)

# Create Range of dates with the pd.range() method,part-1

This prints all the range of a dates from start to end  ,based on freq condition.

This returns from starting to end dates as datetime index

Here by start and end.

Types of freq--->

2. "NH"----> INTREVAL OF N HOURS
3. "ND"--> INTREVAL OF N DAYS
4.  "B"--> ALL BUSSINES DAYS IN BETWEEN START AND END.
5. "W"-->  ALL WEEKEND  DAYS IN BETWEEN START AND END.
6. "W-DAY_NAME"-->  ALL DATES WITH  THAT DAY_NAME, BETWEEN START AND END.
7. "M"-->END DATE OF EACH MONTH IN BETWEEN START AND END.
8. "MS"-->START DATE OF EACH MONTH IN  BETWEEN START AND END.
9. "A"-->END DATE OF EACH YEAR IN  BETWEEN START AND END.
10. "AS"-->>START DATE OF EACH YEAR IN  BETWEEN START AND END.

In [6]:
Time=pd.date_range(start="2016-01-01"  ,end="2016-01-10",freq="D")
#creates the datetime indexees from start to end by intreval (OR) incremented of freq

In [8]:
Time
type(Time)

pandas.core.indexes.datetimes.DatetimeIndex

In [10]:
type(Time[0])

pandas._libs.tslibs.timestamps.Timestamp

In [17]:
pd.date_range(start="2016-01-01"  ,end="2016-01-10",freq="2D")
#intreval (OR) incremented by  is 2Days

DatetimeIndex(['2016-01-01', '2016-01-03', '2016-01-05', '2016-01-07',
               '2016-01-09'],
              dtype='datetime64[ns]', freq='2D')

In [18]:
pd.date_range(start="2016-01-01"  ,end="2016-01-10",freq="W")
#RETURNS  only weekends ie, only sundays BETWEEN START AND END

DatetimeIndex(['2016-01-03', '2016-01-10'], dtype='datetime64[ns]', freq='W-SUN')

In [19]:
pd.date_range(start="2016-01-01"  ,end="2016-01-10",freq="b")
# RETURNS ALL BUSSINESS DAYS(MON-FRI)  IN BETWEEN START AND END DATES

DatetimeIndex(['2016-01-01', '2016-01-04', '2016-01-05', '2016-01-06',
               '2016-01-07', '2016-01-08'],
              dtype='datetime64[ns]', freq='B')

In [23]:
pd.date_range(start="2016-01-01"  ,end="2056-01-10",freq="A")
pd.date_range(start="2016-01-01"  ,end="2056-01-10",freq="AS")
pd.date_range(start="2016-01-01"  ,end="2016-12-31",freq="M")

DatetimeIndex(['2016-01-31', '2016-02-29', '2016-03-31', '2016-04-30',
               '2016-05-31', '2016-06-30', '2016-07-31', '2016-08-31',
               '2016-09-30', '2016-10-31', '2016-11-30', '2016-12-31'],
              dtype='datetime64[ns]', freq='M')

In [25]:
pd.date_range(start="2016-01-01"  ,end="2016-01-31",freq="W-SAT")
# only saturday's

DatetimeIndex(['2016-01-02', '2016-01-09', '2016-01-16', '2016-01-23',
               '2016-01-30'],
              dtype='datetime64[ns]', freq='W-SAT')

# Create Range of dates with the pd.range() method,part-2


Here by start and period.

This returns the number of the indexes, with the given period as datetime index i.e after the given date(start).

And same freq condition holds as before

In [35]:
pd.date_range(start="2012-09-09",periods=25, freq="D")

DatetimeIndex(['2012-09-09', '2012-09-10', '2012-09-11', '2012-09-12',
               '2012-09-13', '2012-09-14', '2012-09-15', '2012-09-16',
               '2012-09-17', '2012-09-18', '2012-09-19', '2012-09-20',
               '2012-09-21', '2012-09-22', '2012-09-23', '2012-09-24',
               '2012-09-25', '2012-09-26', '2012-09-27', '2012-09-28',
               '2012-09-29', '2012-09-30', '2012-10-01', '2012-10-02',
               '2012-10-03'],
              dtype='datetime64[ns]', freq='D')

In [36]:
pd.date_range(start="2012-09-09",periods=25, freq="B")

DatetimeIndex(['2012-09-10', '2012-09-11', '2012-09-12', '2012-09-13',
               '2012-09-14', '2012-09-17', '2012-09-18', '2012-09-19',
               '2012-09-20', '2012-09-21', '2012-09-24', '2012-09-25',
               '2012-09-26', '2012-09-27', '2012-09-28', '2012-10-01',
               '2012-10-02', '2012-10-03', '2012-10-04', '2012-10-05',
               '2012-10-08', '2012-10-09', '2012-10-10', '2012-10-11',
               '2012-10-12'],
              dtype='datetime64[ns]', freq='B')

In [37]:
pd.date_range(start="2012-09-09",periods=25, freq="W")

DatetimeIndex(['2012-09-09', '2012-09-16', '2012-09-23', '2012-09-30',
               '2012-10-07', '2012-10-14', '2012-10-21', '2012-10-28',
               '2012-11-04', '2012-11-11', '2012-11-18', '2012-11-25',
               '2012-12-02', '2012-12-09', '2012-12-16', '2012-12-23',
               '2012-12-30', '2013-01-06', '2013-01-13', '2013-01-20',
               '2013-01-27', '2013-02-03', '2013-02-10', '2013-02-17',
               '2013-02-24'],
              dtype='datetime64[ns]', freq='W-SUN')

In [38]:
pd.date_range(start="2012-09-09",periods=25, freq="W-THU")

DatetimeIndex(['2012-09-13', '2012-09-20', '2012-09-27', '2012-10-04',
               '2012-10-11', '2012-10-18', '2012-10-25', '2012-11-01',
               '2012-11-08', '2012-11-15', '2012-11-22', '2012-11-29',
               '2012-12-06', '2012-12-13', '2012-12-20', '2012-12-27',
               '2013-01-03', '2013-01-10', '2013-01-17', '2013-01-24',
               '2013-01-31', '2013-02-07', '2013-02-14', '2013-02-21',
               '2013-02-28'],
              dtype='datetime64[ns]', freq='W-THU')

In [39]:
pd.date_range(start="2012-09-09",periods=25, freq="M")

DatetimeIndex(['2012-09-30', '2012-10-31', '2012-11-30', '2012-12-31',
               '2013-01-31', '2013-02-28', '2013-03-31', '2013-04-30',
               '2013-05-31', '2013-06-30', '2013-07-31', '2013-08-31',
               '2013-09-30', '2013-10-31', '2013-11-30', '2013-12-31',
               '2014-01-31', '2014-02-28', '2014-03-31', '2014-04-30',
               '2014-05-31', '2014-06-30', '2014-07-31', '2014-08-31',
               '2014-09-30'],
              dtype='datetime64[ns]', freq='M')

In [40]:
pd.date_range(start="2012-09-09",periods=25, freq="A")

DatetimeIndex(['2012-12-31', '2013-12-31', '2014-12-31', '2015-12-31',
               '2016-12-31', '2017-12-31', '2018-12-31', '2019-12-31',
               '2020-12-31', '2021-12-31', '2022-12-31', '2023-12-31',
               '2024-12-31', '2025-12-31', '2026-12-31', '2027-12-31',
               '2028-12-31', '2029-12-31', '2030-12-31', '2031-12-31',
               '2032-12-31', '2033-12-31', '2034-12-31', '2035-12-31',
               '2036-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [41]:
pd.date_range(start="2012-09-09",periods=50, freq="H")

DatetimeIndex(['2012-09-09 00:00:00', '2012-09-09 01:00:00',
               '2012-09-09 02:00:00', '2012-09-09 03:00:00',
               '2012-09-09 04:00:00', '2012-09-09 05:00:00',
               '2012-09-09 06:00:00', '2012-09-09 07:00:00',
               '2012-09-09 08:00:00', '2012-09-09 09:00:00',
               '2012-09-09 10:00:00', '2012-09-09 11:00:00',
               '2012-09-09 12:00:00', '2012-09-09 13:00:00',
               '2012-09-09 14:00:00', '2012-09-09 15:00:00',
               '2012-09-09 16:00:00', '2012-09-09 17:00:00',
               '2012-09-09 18:00:00', '2012-09-09 19:00:00',
               '2012-09-09 20:00:00', '2012-09-09 21:00:00',
               '2012-09-09 22:00:00', '2012-09-09 23:00:00',
               '2012-09-10 00:00:00', '2012-09-10 01:00:00',
               '2012-09-10 02:00:00', '2012-09-10 03:00:00',
               '2012-09-10 04:00:00', '2012-09-10 05:00:00',
               '2012-09-10 06:00:00', '2012-09-10 07:00:00',
               '2012-09-10 08:00:00', '2012-09-10 09:00:00',
               '2012-09-10 10:00:00', '2012-09-10 11:00:00',
               '2012-09-10 12:00:00', '2012-09-10 13:00:00',
               '2012-09-10 14:00:00', '2012-09-10 15:00:00',
               '2012-09-10 16:00:00', '2012-09-10 17:00:00',
               '2012-09-10 18:00:00', '2012-09-10 19:00:00',
               '2012-09-10 20:00:00', '2012-09-10 21:00:00',
               '2012-09-10 22:00:00', '2012-09-10 23:00:00',
               '2012-09-11 00:00:00', '2012-09-11 01:00:00'],
              dtype='datetime64[ns]', freq='H')

# Create Range of dates with the pd.range() method,part-3

Here by end and period.

This returns the number of the indexes, with the given period as datetime index by end i.e before the given date(end).

And same freq condition holds as before

In [42]:
pd.date_range(end="1999-12-31", periods=20,freq="M")

DatetimeIndex(['1998-05-31', '1998-06-30', '1998-07-31', '1998-08-31',
               '1998-09-30', '1998-10-31', '1998-11-30', '1998-12-31',
               '1999-01-31', '1999-02-28', '1999-03-31', '1999-04-30',
               '1999-05-31', '1999-06-30', '1999-07-31', '1999-08-31',
               '1999-09-30', '1999-10-31', '1999-11-30', '1999-12-31'],
              dtype='datetime64[ns]', freq='M')

In [45]:
pd.date_range(end="1999-12-31", periods=20,freq="H")

DatetimeIndex(['1999-12-30 05:00:00', '1999-12-30 06:00:00',
               '1999-12-30 07:00:00', '1999-12-30 08:00:00',
               '1999-12-30 09:00:00', '1999-12-30 10:00:00',
               '1999-12-30 11:00:00', '1999-12-30 12:00:00',
               '1999-12-30 13:00:00', '1999-12-30 14:00:00',
               '1999-12-30 15:00:00', '1999-12-30 16:00:00',
               '1999-12-30 17:00:00', '1999-12-30 18:00:00',
               '1999-12-30 19:00:00', '1999-12-30 20:00:00',
               '1999-12-30 21:00:00', '1999-12-30 22:00:00',
               '1999-12-30 23:00:00', '1999-12-31 00:00:00'],
              dtype='datetime64[ns]', freq='H')

In [44]:
pd.date_range(end="1999-12-31", periods=20,freq="W-SUN")

DatetimeIndex(['1999-08-15', '1999-08-22', '1999-08-29', '1999-09-05',
               '1999-09-12', '1999-09-19', '1999-09-26', '1999-10-03',
               '1999-10-10', '1999-10-17', '1999-10-24', '1999-10-31',
               '1999-11-07', '1999-11-14', '1999-11-21', '1999-11-28',
               '1999-12-05', '1999-12-12', '1999-12-19', '1999-12-26'],
              dtype='datetime64[ns]', freq='W-SUN')

In [43]:
pd.date_range(end="1999-12-31", periods=20,freq="D")

DatetimeIndex(['1999-12-12', '1999-12-13', '1999-12-14', '1999-12-15',
               '1999-12-16', '1999-12-17', '1999-12-18', '1999-12-19',
               '1999-12-20', '1999-12-21', '1999-12-22', '1999-12-23',
               '1999-12-24', '1999-12-25', '1999-12-26', '1999-12-27',
               '1999-12-28', '1999-12-29', '1999-12-30', '1999-12-31'],
              dtype='datetime64[ns]', freq='D')

In [46]:
pd.date_range(end="1999-12-31", periods=20,freq="b")

DatetimeIndex(['1999-12-06', '1999-12-07', '1999-12-08', '1999-12-09',
               '1999-12-10', '1999-12-13', '1999-12-14', '1999-12-15',
               '1999-12-16', '1999-12-17', '1999-12-20', '1999-12-21',
               '1999-12-22', '1999-12-23', '1999-12-24', '1999-12-27',
               '1999-12-28', '1999-12-29', '1999-12-30', '1999-12-31'],
              dtype='datetime64[ns]', freq='B')

In [47]:
pd.date_range(end="1999-12-31", periods=50,freq="MS")

DatetimeIndex(['1995-11-01', '1995-12-01', '1996-01-01', '1996-02-01',
               '1996-03-01', '1996-04-01', '1996-05-01', '1996-06-01',
               '1996-07-01', '1996-08-01', '1996-09-01', '1996-10-01',
               '1996-11-01', '1996-12-01', '1997-01-01', '1997-02-01',
               '1997-03-01', '1997-04-01', '1997-05-01', '1997-06-01',
               '1997-07-01', '1997-08-01', '1997-09-01', '1997-10-01',
               '1997-11-01', '1997-12-01', '1998-01-01', '1998-02-01',
               '1998-03-01', '1998-04-01', '1998-05-01', '1998-06-01',
               '1998-07-01', '1998-08-01', '1998-09-01', '1998-10-01',
               '1998-11-01', '1998-12-01', '1999-01-01', '1999-02-01',
               '1999-03-01', '1999-04-01', '1999-05-01', '1999-06-01',
               '1999-07-01', '1999-08-01', '1999-09-01', '1999-10-01',
               '1999-11-01', '1999-12-01'],
              dtype='datetime64[ns]', freq='MS')

In [48]:
pd.date_range(end="1999-12-31", periods=50,freq="AS")

DatetimeIndex(['1950-01-01', '1951-01-01', '1952-01-01', '1953-01-01',
               '1954-01-01', '1955-01-01', '1956-01-01', '1957-01-01',
               '1958-01-01', '1959-01-01', '1960-01-01', '1961-01-01',
               '1962-01-01', '1963-01-01', '1964-01-01', '1965-01-01',
               '1966-01-01', '1967-01-01', '1968-01-01', '1969-01-01',
               '1970-01-01', '1971-01-01', '1972-01-01', '1973-01-01',
               '1974-01-01', '1975-01-01', '1976-01-01', '1977-01-01',
               '1978-01-01', '1979-01-01', '1980-01-01', '1981-01-01',
               '1982-01-01', '1983-01-01', '1984-01-01', '1985-01-01',
               '1986-01-01', '1987-01-01', '1988-01-01', '1989-01-01',
               '1990-01-01', '1991-01-01', '1992-01-01', '1993-01-01',
               '1994-01-01', '1995-01-01', '1996-01-01', '1997-01-01',
               '1998-01-01', '1999-01-01'],
              dtype='datetime64[ns]', freq='AS-JAN')

In [50]:
pd.date_range(end="1999-12-31", periods=50,freq="5M")

DatetimeIndex(['1979-07-31', '1979-12-31', '1980-05-31', '1980-10-31',
               '1981-03-31', '1981-08-31', '1982-01-31', '1982-06-30',
               '1982-11-30', '1983-04-30', '1983-09-30', '1984-02-29',
               '1984-07-31', '1984-12-31', '1985-05-31', '1985-10-31',
               '1986-03-31', '1986-08-31', '1987-01-31', '1987-06-30',
               '1987-11-30', '1988-04-30', '1988-09-30', '1989-02-28',
               '1989-07-31', '1989-12-31', '1990-05-31', '1990-10-31',
               '1991-03-31', '1991-08-31', '1992-01-31', '1992-06-30',
               '1992-11-30', '1993-04-30', '1993-09-30', '1994-02-28',
               '1994-07-31', '1994-12-31', '1995-05-31', '1995-10-31',
               '1996-03-31', '1996-08-31', '1997-01-31', '1997-06-30',
               '1997-11-30', '1998-04-30', '1998-09-30', '1999-02-28',
               '1999-07-31', '1999-12-31'],
              dtype='datetime64[ns]', freq='5M')

# The .dt Accessor


Same as .str() when we are working in text.

If we want to get the attribute on dataseries for datetime we use this functions.

If we want to perform any opearations in the series we use the .dt type attributer.

In [72]:
dunch_of_Dates=pd.date_range(start="2000-01-01",end="2010-12-31",freq="31D")

In [73]:
s=pd.Series(dunch_of_Dates)
s.head(3)

0   2000-01-01
1   2000-02-01
2   2000-03-03
dtype: datetime64[ns]

In [74]:
s.dt.month
#returns the  number of the particular month of the given  values  in series.

0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10
10     11
11     12
12      1
13      2
14      3
15      4
16      5
17      6
18      7
19      8
20      9
21     10
22     11
23     12
24      1
25      2
26      3
27      4
28      5
29      6
       ..
100     6
101     7
102     8
103     9
104    10
105    11
106    12
107     1
108     3
109     4
110     5
111     6
112     7
113     8
114     9
115    10
116    11
117    12
118     1
119     2
120     3
121     4
122     5
123     6
124     7
125     8
126     9
127    10
128    11
129    12
Length: 130, dtype: int64

In [75]:
s.dt.year
#returns the  number of the particular yearof the given  values  in series.

0      2000
1      2000
2      2000
3      2000
4      2000
5      2000
6      2000
7      2000
8      2000
9      2000
10     2000
11     2000
12     2001
13     2001
14     2001
15     2001
16     2001
17     2001
18     2001
19     2001
20     2001
21     2001
22     2001
23     2001
24     2002
25     2002
26     2002
27     2002
28     2002
29     2002
       ...
100    2008
101    2008
102    2008
103    2008
104    2008
105    2008
106    2008
107    2009
108    2009
109    2009
110    2009
111    2009
112    2009
113    2009
114    2009
115    2009
116    2009
117    2009
118    2010
119    2010
120    2010
121    2010
122    2010
123    2010
124    2010
125    2010
126    2010
127    2010
128    2010
129    2010
Length: 130, dtype: int64

In [76]:
s.dt.weekday_name
#returns the  number of the particular Weekday_name of the given  values  in series.

0       Saturday
1        Tuesday
2         Friday
3         Monday
4       Thursday
5         Sunday
6      Wednesday
7       Saturday
8        Tuesday
9         Friday
10        Monday
11      Thursday
12        Sunday
13     Wednesday
14      Saturday
15       Tuesday
16        Friday
17        Monday
18      Thursday
19        Sunday
20     Wednesday
21      Saturday
22       Tuesday
23        Friday
24        Monday
25      Thursday
26        Sunday
27     Wednesday
28      Saturday
29       Tuesday
         ...
100       Friday
101       Monday
102     Thursday
103       Sunday
104    Wednesday
105     Saturday
106      Tuesday
107       Friday
108       Monday
109     Thursday
110       Sunday
111    Wednesday
112     Saturday
113      Tuesday
114       Friday
115       Monday
116     Thursday
117       Sunday
118    Wednesday
119     Saturday
120      Tuesday
121       Friday
122       Monday
123     Thursday
124       Sunday
125    Wednesday
126     Saturday
127      Tuesday
128       Friday
129       Monday
Length: 130, dtype: object

In [80]:
bunch_of_Dates=pd.date_range(start="2000-01-01",end="2010-12-31",freq="31D")

In [81]:
s1=pd.Series(bunch_of_Dates)
s1.head(3)

0   2000-01-01
1   2000-02-01
2   2000-03-03
dtype: datetime64[ns]

In [78]:
mask=s1.dt.is_month_end
mask

NameError: name 's1' is not defined

In [84]:
mask=s1.dt.is_quarter_start
# true if that date falls on start of the quater 
s1[mask]

0    2000-01-01
53   2004-07-01
dtype: datetime64[ns]

In [85]:
mask=s1.dt.is_month_start
# true if that date falls on start of the month 
s1[mask]

0    2000-01-01
1    2000-02-01
53   2004-07-01
54   2004-08-01
55   2004-09-01
dtype: datetime64[ns]

In [86]:
mask=s1.dt.is_month_end
# true if that date falls on end of the month 
s1[mask]

51   2004-04-30
52   2004-05-31
dtype: datetime64[ns]

# Import Financial Data Set with pandas_datareader Library


This is use full to work with the raeal time data sets avvailable in web and perform operations.

This observers the data set from the internate by datareader() method.

Here we call each rows as the "TRADE".

syntax-->data.DataReader(name, data_source=None, start=None, end=None, retry_count=3, pause=0.1, session=None, access_key=None)

name-->name of company, datasource---> this is the source of financial data blocks that are in the internet.

Types of datasource, at present "iex" is used.
1. google.-->(not available today)
2. iex.
3. Alpha Vantage..-->(not available today)
4. Quandl..-->(needs subscription)

This takes the dataset stocks, (i.e stockmarket name of the company) from the internet and perform the required operations as we like by using the datareader function.

THis returns the set of columns as the open,high,close,low,volume,

1. open-->So we have the open which is the price when the stock opened at the beginning of the day.
2. close-->We have the price when it closed at end of day.
3. high-->We have its high point throughout the day and which is the maximum that it reached price for that day..
4. low-->We have its low point throughout the day and which is the maximum that it reached price for that day..
5. volume--> volume is  the number of stocks that were traded that day for that company.

In [4]:
from pandas_datareader import data

ModuleNotFoundError: No module named 'pandas_datareader'

In [5]:
company="GOOGL" #googles financial data set.
start="2013-01-01"
end="2017-12-31"
googl=data.DataReader(name=company, data_source="iex", start=start, end=end)
googl.head()

NameError: name 'data' is not defined

In [54]:
googl.values
googl.columns
googl.index
googl.index[0]

'2013-11-22'

In [46]:
company= ["TCS","INFY"] #infosys and tcs financial data set.
start="2013-01-01"
end="2017-12-31"
tcinfo=data.DataReader(name=company, data_source="iex", start=start, end=end)
tcinfo.head()

Attributes    open           high             low          close         \
Symbols       INFY    TCS    INFY     TCS    INFY    TCS    INFY    TCS
date
2013-11-22  5.8853  35.60  5.9325  37.598  5.8666  35.27  5.9215  37.36
2013-11-25  5.8919  37.99  5.8919  39.000  5.8403  37.76  5.8458  38.20
2013-11-26  5.8458  39.10  5.9150  40.300  5.8018  38.71  5.8853  40.06
2013-11-27  5.8469  41.14  5.8600  41.500  5.8095  40.35  5.8414  40.48
2013-11-29  5.9040  41.34  5.9880  41.700  5.8897  40.50  5.9325  40.69

Attributes   volume
Symbols        INFY     TCS
date
2013-11-22  6069736  434786
2013-11-25  8267448  370850
2013-11-26  7948592  789901
2013-11-27  8684648  413669
2013-11-29  3258744  169896

In [53]:
tcinfo.values
tcinfo.columns
tcinfo.index
tcinfo.index[0]

'2013-11-22'

# Selecting Rows from a DataFrame with a DateTimeIndex

Here convert the indexes fro str to Time stamp by pd.to_datetime() function.

We can perform operations when we convert date from string to time stamp only.

In [125]:
company="GOOGL"
start="2013-01-01"
end="2017-12-31"
googl=data.DataReader(name=company, data_source="iex", start=start, end=end)
googl.head(3)

                open      high       low     close   volume
date
2013-11-22  517.2267  518.6031  515.1259  516.4609  2506114
2013-11-25  519.0986  527.1216  518.0288  523.4880  3222795
2013-11-26  524.8243  531.2808  521.9890  529.7342  4569794

In [126]:
googl.loc["2013-11-27"]
googl.iloc[300]
googl.ix[["2014-11-17"]]
googl.ix[300]

E:\anaconda\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
E:\anaconda\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

open          533.140
high          536.746
low           525.030
close         526.100
volume    1694832.000
Name: 2015-02-04, dtype: float64

In [127]:
googl.loc["2013-11-27":"2013-12-27"]
googl.iloc[300:354]
googl.ix["2014-01-17":"2014-02-17"]
googl.ix[300:360]

E:\anaconda\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
E:\anaconda\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

               open      high       low    close   volume
date
2015-02-04  533.140  536.7460  525.0300  526.100  1694832
2015-02-05  527.930  530.6900  525.6400  529.830  1658751
2015-02-06  531.010  540.2150  528.6500  533.875  2146922
2015-02-09  531.060  533.8800  527.5500  529.280  1515687
2015-02-10  532.150  541.0000  529.1725  540.160  2371468
2015-02-11  539.730  541.9500  536.0000  538.000  1915336
2015-02-12  539.660  548.3400  537.0000  546.010  2429520
2015-02-13  547.510  552.5400  546.6000  551.160  2369115
2015-02-17  551.160  553.0000  543.2600  545.010  1958679
2015-02-18  543.820  547.5500  539.5500  542.650  1558153
2015-02-19  542.470  546.8600  540.7500  546.450  1541669
2015-02-20  547.580  547.5800  538.1000  541.800  1911732
2015-02-23  539.000  539.3000  532.0000  535.000  1645276
2015-02-24  531.550  539.4000  531.0000  538.650  1421373
2015-02-25  538.440  549.5700  538.0100  547.330  2041827
2015-02-26  545.740  560.1299  545.0900  559.290  2701584
2015-02-27  558.150  569.4200  557.0300  562.630  3416445
2015-03-02  567.000  575.9900  563.1500  575.020  2520304
2015-03-03  576.350  580.8500  570.5000  578.795  2526280
2015-03-04  576.970  581.6300  572.5200  578.330  1898150
2015-03-05  579.620  583.2000  578.2300  581.435  1795889
2015-03-06  582.000  582.7800  572.0600  572.900  1879619
2015-03-09  570.920  575.4500  569.0500  574.100  1174244
2015-03-10  568.475  569.7620  559.8200  559.850  2004024
2015-03-11  559.800  564.1800  555.4100  555.690  2026158
2015-03-12  558.480  561.8400  555.5300  561.170  1780057
2015-03-13  559.230  564.3600  550.3300  553.000  1771354
2015-03-16  556.930  563.7500  551.3200  561.640  1842754
2015-03-17  558.290  560.6400  554.4100  557.610  1444560
2015-03-18  557.730  566.5100  553.5000  566.160  1766221
2015-03-19  564.520  566.9600  562.1200  563.670  1232969
2015-03-20  566.710  567.1000  564.4800  564.950  2216038
2015-03-23  566.000  569.6399  563.0600  565.370  1511686
2015-03-24  568.540  581.8800  568.0900  577.540  3957844
2015-03-25  577.570  580.0700  567.0000  567.000  2653451
2015-03-26  564.650  567.1900  558.3100  563.640  2492141
2015-03-27  561.830  564.0660  556.9300  557.550  1727629
2015-03-30  560.250  562.1600  556.7900  561.135  1239350
2015-03-31  557.940  562.4500  554.6700  554.700  1746622
2015-04-01  554.830  558.5000  546.0300  549.490  1945090
2015-04-02  547.410  548.0000  540.4400  541.310  2388019
2015-04-06  538.840  545.5400  535.7000  543.950  1685894
2015-04-07  544.990  550.1600  543.5850  544.860  1365916
2015-04-08  546.000  551.5000  546.0000  548.840  1419316
2015-04-09  549.210  549.3700  541.9510  548.020  1618299
2015-04-10  549.570  549.8500  544.9800  548.540  1305219
2015-04-13  547.050  553.2700  546.3000  548.640  1466277
2015-04-14  546.570  546.5700  535.7400  539.780  2360329
2015-04-15  537.960  543.1900  532.3700  541.040  2348087
2015-04-16  538.350  545.2290  538.1000  543.520  1586088
2015-04-17  537.310  539.8000  529.0000  532.740  2461698
2015-04-20  533.750  545.8000  533.3500  544.530  1926064
2015-04-21  546.310  547.7745  542.2100  542.925  1456387
2015-04-22  543.060  551.0000  541.3200  549.180  1590320
2015-04-23  550.410  561.1700  550.0800  557.460  3909155
2015-04-24  580.050  584.7000  568.3500  573.660  4608403
2015-04-27  572.770  575.5200  562.3000  566.120  2403105
2015-04-28  564.320  567.8300  560.9600  564.370  1859787
2015-04-29  560.510  565.8400  559.0000  561.390  1681064
2015-04-30  558.560  561.1100  546.7200  548.770  2362024

In [14]:
years=pd.date_range(start="2011-02-04",end="2017-12-31",freq=pd.DateOffset(years=1))
#returns the list of dates from 1991 to 2017 with 1 month incrementation (or) interval
years

DatetimeIndex(['2011-02-04', '2012-02-04', '2013-02-04', '2014-02-04',
               '2015-02-04', '2016-02-04', '2017-02-04'],
              dtype='datetime64[ns]', freq='<DateOffset: years=1>')

In [37]:
googl.index=pd.to_datetime(googl.index)
googl.index

DatetimeIndex(['2013-11-22', '2013-11-25', '2013-11-26', '2013-11-27',
               '2013-11-29', '2013-12-02', '2013-12-03', '2013-12-04',
               '2013-12-05', '2013-12-06',
               ...
               '2017-12-15', '2017-12-18', '2017-12-19', '2017-12-20',
               '2017-12-21', '2017-12-22', '2017-12-26', '2017-12-27',
               '2017-12-28', '2017-12-29'],
              dtype='datetime64[ns]', name='date', length=1033, freq=None)

In [38]:
mask=googl.index.isin(years)
#returns the bolean that exists on year lists

In [39]:
googl.loc[mask]
#returns the rows that satisfy the mask.

               open      high       low     close   volume
date
2014-02-04  569.564  578.0775  569.0735  569.6491  5625848
2015-02-04  533.140  536.7460  525.0300  526.1000  1694832
2016-02-04  744.590  745.2400  722.6001  730.0300  5246123

# TIME STAMP OBJECT ATTRIBUTES

In [79]:
company="GOOGL"
start="2013-01-01"
end="2017-12-31"
googl=data.DataReader(name=company, data_source="iex", start=start, end=end)
googl.head(3)

                open      high       low     close   volume
date
2013-11-22  517.2267  518.6031  515.1259  516.4609  2506114
2013-11-25  519.0986  527.1216  518.0288  523.4880  3222795
2013-11-26  524.8243  531.2808  521.9890  529.7342  4569794

In [80]:
googl.index=pd.to_datetime(googl.index)
googl.index

DatetimeIndex(['2013-11-22', '2013-11-25', '2013-11-26', '2013-11-27',
               '2013-11-29', '2013-12-02', '2013-12-03', '2013-12-04',
               '2013-12-05', '2013-12-06',
               ...
               '2017-12-15', '2017-12-18', '2017-12-19', '2017-12-20',
               '2017-12-21', '2017-12-22', '2017-12-26', '2017-12-27',
               '2017-12-28', '2017-12-29'],
              dtype='datetime64[ns]', name='date', length=1033, freq=None)

In [81]:
type(googl.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [82]:
someday=pd.to_datetime(googl.index[100])
someday

Timestamp('2014-04-21 00:00:00')

In [83]:
someday.day
someday.month
someday.year
someday.weekday_name
someday.is_month_start
someday.is_month_end

E:\anaconda\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: `weekday_name` is deprecated and will be removed in a future version. Use `day_name` instead
  after removing the cwd from sys.path.

False

In [84]:
googl.insert(0, "Day of Week",googl.index.weekday_name)
#creating (or) Inserts the  new column for week days by this ",googl.index.weekday_name"

In [85]:
googl.insert(1, "IS MONTH START",googl.index.is_month_start)

In [86]:
googl.insert(2, "IS MONTH END",googl.index.is_month_end)

In [87]:
googl.head()

,Day of Week,IS MONTH START,IS MONTH END,open,high,low,close,volume
date,,,,,,,,
2013-11-22,Friday,False,False,517.2267,518.6031,515.1259,516.4609,2506114
2013-11-25,Monday,False,False,519.0986,527.1216,518.0288,523.4880,3222795
2013-11-26,Tuesday,False,False,524.8243,531.2808,521.9890,529.7342,4569794
2013-11-27,Wednesday,False,False,531.5460,534.5340,530.5300,532.0866,2244873
2013-11-29,Friday,False,False,531.6111,533.8433,530.2547,530.3248,2383163

In [88]:
googl[googl["IS MONTH START"]] # returns starting month trade.

,Day of Week,IS MONTH START,IS MONTH END,open,high,low,close,volume
date,,,,,,,,
2014-04-01,Tuesday,True,False,560.6951,569.3188,559.559,568.0124,4360891
2014-05-01,Thursday,True,False,534.2500,539.9100,532.860,538.5300,2004375
2014-07-01,Tuesday,True,False,587.6500,593.6600,586.290,591.4900,1644628
2014-08-01,Friday,True,False,578.5550,583.4300,570.300,573.6000,2213790
2014-10-01,Wednesday,True,False,586.8000,588.7200,578.020,579.6300,1449686
2014-12-01,Monday,True,False,545.0900,548.7900,538.620,539.6500,1994399
2015-04-01,Wednesday,True,False,554.8300,558.5000,546.030,549.4900,1945090
2015-05-01,Friday,True,False,550.5100,551.2200,543.850,551.1600,1828566
2015-06-01,Monday,True,False,548.7300,550.5700,543.580,549.2100,1660500
2015-07-01,Wednesday,True,False,543.6600,545.8100,539.760,543.3000,1537973
2015-09-01,Tuesday,True,False,633.6600,644.4400,625.060,629.5600,2572884
2015-10-01,Thursday,True,False,637.9400,643.8400,631.115,642.0000,2125315
2015-12-01,Tuesday,True,False,766.9400,785.0000,765.950,783.7900,2019864
2016-02-01,Monday,True,False,771.2600,777.5900,761.380,770.7700,5576089
2016-03-01,Tuesday,True,False,721.3000,742.3300,718.640,742.1700,3005553
2016-04-01,Friday,True,False,757.1600,770.0400,755.200,769.6700,1583698
2016-06-01,Wednesday,True,False,748.4700,751.3700,744.340,748.4600,1039847
2016-07-01,Friday,True,False,705.1000,712.5300,703.730,710.2500,1549160
2016-08-01,Monday,True,False,786.6700,807.4900,785.040,800.9400,3029658
2016-09-01,Thursday,True,False,791.9800,792.8900,786.330,791.4000,1303460
2016-11-01,Tuesday,True,False,810.8700,813.9600,798.260,805.4800,2355890
2016-12-01,Thursday,True,False,778.5500,778.6000,753.360,764.3300,2867074
2017-02-01,Wednesday,True,False,824.0000,824.0000,812.250,815.2400,2251047
2017-03-01,Wednesday,True,False,851.3800,858.0000,849.020,856.7500,1818671
2017-05-01,Monday,True,False,924.1500,935.8200,920.800,932.8200,2327782
2017-06-01,Thursday,True,False,990.9600,993.1400,981.290,988.2900,1306384
2017-08-01,Tuesday,True,False,947.8100,954.4900,944.960,946.5600,1332456
2017-09-01,Friday,True,False,957.4700,958.3300,950.280,951.9900,1042885
2017-11-01,Wednesday,True,False,1036.3200,1047.8600,1034.000,1042.6000,2163073
2017-12-01,Friday,True,False,1030.4100,1037.2400,1016.900,1025.0700,1888081

# THE.trunctae() method

Used for slicing operations of trade.

In [103]:
company="GOOGL"
start="2013-01-01"
end="2017-12-31"
googl=data.DataReader(name=company, data_source="iex", start=start, end=end)
googl.head(3)

                open      high       low     close   volume
date
2013-11-22  517.2267  518.6031  515.1259  516.4609  2506114
2013-11-25  519.0986  527.1216  518.0288  523.4880  3222795
2013-11-26  524.8243  531.2808  521.9890  529.7342  4569794

In [105]:
googl.index=pd.to_datetime(googl.index)

In [108]:
googl.truncate(before="2015-02-05", after="2015-02-28")
#returns dataframe of dates from "2015-02-05" to"2015-02-28"

              open      high       low    close   volume
date
2015-02-05  527.93  530.6900  525.6400  529.830  1658751
2015-02-06  531.01  540.2150  528.6500  533.875  2146922
2015-02-09  531.06  533.8800  527.5500  529.280  1515687
2015-02-10  532.15  541.0000  529.1725  540.160  2371468
2015-02-11  539.73  541.9500  536.0000  538.000  1915336
2015-02-12  539.66  548.3400  537.0000  546.010  2429520
2015-02-13  547.51  552.5400  546.6000  551.160  2369115
2015-02-17  551.16  553.0000  543.2600  545.010  1958679
2015-02-18  543.82  547.5500  539.5500  542.650  1558153
2015-02-19  542.47  546.8600  540.7500  546.450  1541669
2015-02-20  547.58  547.5800  538.1000  541.800  1911732
2015-02-23  539.00  539.3000  532.0000  535.000  1645276
2015-02-24  531.55  539.4000  531.0000  538.650  1421373
2015-02-25  538.44  549.5700  538.0100  547.330  2041827
2015-02-26  545.74  560.1299  545.0900  559.290  2701584
2015-02-27  558.15  569.4200  557.0300  562.630  3416445

# The pd.DateOffset Objects

Here we are going to manuplate the stock dataframes by operations using dataoffset() function. .

Here we are using datetime objects in start and end so, dt.datetime.now() gets current time and date we can give date object also for start and end unless only string

In [121]:
msft=data.DataReader(name="MSFT",data_source="iex",start=dt.date(2015,1,1),end=dt.datetime.now())
# gets stocks form 2015 to present day.
msft.index=pd.to_datetime(msft.index)
msft.head()

               open     high      low    close    volume
date
2015-01-02  42.5088  43.2012  42.3994  42.5999  27913852
2015-01-05  42.2446  42.5725  42.1352  42.2036  39673865
2015-01-06  42.2537  42.5899  41.4884  41.5886  36447854
2015-01-07  41.8893  42.3266  41.4429  42.1170  29114061
2015-01-08  42.5908  43.5017  42.5634  43.3560  29645202

In [122]:
#operations using dataoffset() function.
msft.index+pd.DateOffset(days=5) #adds five days to every index of date.
msft.index+pd.DateOffset(weeks=5) #adds five weeks to every index of date.
msft.index-pd.DateOffset(months=5) #subtracts five dmonths to every index of date.

DatetimeIndex(['2014-08-02', '2014-08-05', '2014-08-06', '2014-08-07',
               '2014-08-08', '2014-08-09', '2014-08-12', '2014-08-13',
               '2014-08-14', '2014-08-15',
               ...
               '2018-06-08', '2018-06-09', '2018-06-12', '2018-06-13',
               '2018-06-14', '2018-06-15', '2018-06-16', '2018-06-19',
               '2018-06-20', '2018-06-21'],
              dtype='datetime64[ns]', name='date', length=981, freq=None)

In [124]:
msft.index+pd.DateOffset(hours=6) #subtracts six hours to every index of date.

DatetimeIndex(['2015-01-02 06:00:00', '2015-01-05 06:00:00',
               '2015-01-06 06:00:00', '2015-01-07 06:00:00',
               '2015-01-08 06:00:00', '2015-01-09 06:00:00',
               '2015-01-12 06:00:00', '2015-01-13 06:00:00',
               '2015-01-14 06:00:00', '2015-01-15 06:00:00',
               ...
               '2018-11-08 06:00:00', '2018-11-09 06:00:00',
               '2018-11-12 06:00:00', '2018-11-13 06:00:00',
               '2018-11-14 06:00:00', '2018-11-15 06:00:00',
               '2018-11-16 06:00:00', '2018-11-19 06:00:00',
               '2018-11-20 06:00:00', '2018-11-21 06:00:00'],
              dtype='datetime64[ns]', name='date', length=981, freq=None)

In [133]:
#adding multiple datetime objects.
msft.index+pd.DateOffset(weeks=5,months=5,days=6,hours=5,minutes=42) 
#adds 5 weeks,5months,5days,5hours,5minutes to the dateindex time stamp object.

DatetimeIndex(['2015-07-13 05:42:00', '2015-07-16 05:42:00',
               '2015-07-17 05:42:00', '2015-07-18 05:42:00',
               '2015-07-19 05:42:00', '2015-07-20 05:42:00',
               '2015-07-23 05:42:00', '2015-07-24 05:42:00',
               '2015-07-25 05:42:00', '2015-07-26 05:42:00',
               ...
               '2019-05-19 05:42:00', '2019-05-20 05:42:00',
               '2019-05-23 05:42:00', '2019-05-24 05:42:00',
               '2019-05-25 05:42:00', '2019-05-26 05:42:00',
               '2019-05-27 05:42:00', '2019-05-30 05:42:00',
               '2019-05-31 05:42:00', '2019-06-01 05:42:00'],
              dtype='datetime64[ns]', name='date', length=981, freq=None)

# More Fun with pd.DateOffset Objects

Here we import the library called " pandas.tseries.offsets" and to import every function in thst we use *

In [141]:
from pandas.tseries.offsets import *

In [136]:
msft=data.DataReader(name="MSFT",data_source="iex",start=dt.date(2015,1,1),end=dt.datetime.now())
msft.index=pd.to_datetime(msft.index)
msft.head()

               open     high      low    close    volume
date
2015-01-02  42.5088  43.2012  42.3994  42.5999  27913852
2015-01-05  42.2446  42.5725  42.1352  42.2036  39673865
2015-01-06  42.2537  42.5899  41.4884  41.5886  36447854
2015-01-07  41.8893  42.3266  41.4429  42.1170  29114061
2015-01-08  42.5908  43.5017  42.5634  43.3560  29645202

In [145]:
msft.index+MonthEnd() 
#it look at the date and then find the next month 
#ie for every date it replaces the day with end day  of current month.

DatetimeIndex(['2015-01-31', '2015-01-31', '2015-01-31', '2015-01-31',
               '2015-01-31', '2015-01-31', '2015-01-31', '2015-01-31',
               '2015-01-31', '2015-01-31',
               ...
               '2018-11-30', '2018-11-30', '2018-11-30', '2018-11-30',
               '2018-11-30', '2018-11-30', '2018-11-30', '2018-11-30',
               '2018-11-30', '2018-11-30'],
              dtype='datetime64[ns]', name='date', length=981, freq=None)

In [144]:
msft.index-MonthEnd() 
#ie,for every day it replaces the day with  perivious month end.

DatetimeIndex(['2014-12-31', '2014-12-31', '2014-12-31', '2014-12-31',
               '2014-12-31', '2014-12-31', '2014-12-31', '2014-12-31',
               '2014-12-31', '2014-12-31',
               ...
               '2018-10-31', '2018-10-31', '2018-10-31', '2018-10-31',
               '2018-10-31', '2018-10-31', '2018-10-31', '2018-10-31',
               '2018-10-31', '2018-10-31'],
              dtype='datetime64[ns]', name='date', length=981, freq=None)

In [146]:
msft.index+BMonthEnd()
#ie,for every day it replaces the day with Bussines month of current month.

DatetimeIndex(['2015-01-30', '2015-01-30', '2015-01-30', '2015-01-30',
               '2015-01-30', '2015-01-30', '2015-01-30', '2015-01-30',
               '2015-01-30', '2015-01-30',
               ...
               '2018-11-30', '2018-11-30', '2018-11-30', '2018-11-30',
               '2018-11-30', '2018-11-30', '2018-11-30', '2018-11-30',
               '2018-11-30', '2018-11-30'],
              dtype='datetime64[ns]', name='date', length=981, freq=None)

In [150]:
msft.index+QuarterEnd()  #ie,for every day it replaces the day withend of quater month day of year
msft.index+QuarterBegin() #ie,for every day it replaces the day with quatrter month day of year.

DatetimeIndex(['2015-03-01', '2015-03-01', '2015-03-01', '2015-03-01',
               '2015-03-01', '2015-03-01', '2015-03-01', '2015-03-01',
               '2015-03-01', '2015-03-01',
               ...
               '2018-12-01', '2018-12-01', '2018-12-01', '2018-12-01',
               '2018-12-01', '2018-12-01', '2018-12-01', '2018-12-01',
               '2018-12-01', '2018-12-01'],
              dtype='datetime64[ns]', name='date', length=981, freq=None)

In [152]:
msft.index+YearBegin()  #ie,for every day it replaces the day with begin day of year
msft.index+YearEnd() #ie,for every day it replaces the day with end day of year.

DatetimeIndex(['2015-12-31', '2015-12-31', '2015-12-31', '2015-12-31',
               '2015-12-31', '2015-12-31', '2015-12-31', '2015-12-31',
               '2015-12-31', '2015-12-31',
               ...
               '2018-12-31', '2018-12-31', '2018-12-31', '2018-12-31',
               '2018-12-31', '2018-12-31', '2018-12-31', '2018-12-31',
               '2018-12-31', '2018-12-31'],
              dtype='datetime64[ns]', name='date', length=981, freq=None)

# The pandas Timedelta Object

This function returns the time difference and time allocation of the values as Time delta object.

This function has pd.Timedelta() method which returns the timedelta object,ie(N-days HH-MM-SS) format where N=number of days output by given input.

Example for "Timedelta object is "365 days"".

In [154]:
timeA=pd.Timestamp("2016-03-31 04:35:16 PM")
timeB=pd.Timestamp("2016-03-20 04:35:16 PM")

In [155]:
timeB-timeA #differnece between  B and A

Timedelta('-11 days +00:00:00')

In [156]:
timeA-timeB   #differnece between A and B

Timedelta('11 days 00:00:00')

In [157]:
type(timeA-timeB)

pandas._libs.tslibs.timedeltas.Timedelta

In [158]:
type(timeA)

pandas._libs.tslibs.timestamps.Timestamp

In [162]:
pd.Timedelta(weeks=5,days=3, hours=5,minutes=45)
#days=5*7+3=35+3=38days

Timedelta('38 days 05:45:00')

In [164]:
pd.Timedelta("3 days 5 hours 45 minutes 45 seconds")
#this dosen't include the week key word.

Timedelta('3 days 05:45:45')

# Time delta in dataset()

Always subract the Timedelta object from date object.

In [171]:
shipping=pd.read_csv("ecommerce.csv",index_col="ID",parse_dates=["order_date","delivery_date"])
shipping.head()

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26
5  1992-07-21    1997-11-20
7  1993-09-02    1998-06-10

In [173]:
shipping["Delivery time"]=shipping["delivery_date"]-shipping["order_date"]

In [180]:
type(shipping["Delivery time"])
# This Delivery time is the timestamp.

pandas.core.series.Series

In [181]:
shipping.head(3)

   order_date delivery_date Delivery time
ID
1  1998-05-24    1999-02-05      257 days
2  1992-04-22    1998-03-06     2144 days
4  1991-02-10    1992-08-26      563 days

In [190]:
(shipping["delivery_date"]+shipping["Delivery time"]).head()
shipping["Twice_As_long_As"]=shipping["delivery_date"]+shipping["Delivery time"]
shipping.head()

   order_date delivery_date Delivery time Twice_As_long_As
ID
1  1998-05-24    1999-02-05      257 days       1999-10-20
2  1992-04-22    1998-03-06     2144 days       2004-01-18
4  1991-02-10    1992-08-26      563 days       1994-03-12
5  1992-07-21    1997-11-20     1948 days       2003-03-22
7  1993-09-02    1998-06-10     1742 days       2003-03-18

In [185]:
(shipping["delivery_date"]-shipping["Delivery time"]).head()

ID
1   1998-05-24
2   1992-04-22
4   1991-02-10
5   1992-07-21
7   1993-09-02
dtype: datetime64[ns]

In [189]:
shipping.dtypes

order_date           datetime64[ns]
delivery_date        datetime64[ns]
Delivery time       timedelta64[ns]
Twice_As_long_As     datetime64[ns]
dtype: object

In [201]:
shipping[shipping["Delivery time"]>"3000 days"]

    order_date delivery_date Delivery time Twice_As_long_As
ID
32  1990-01-20    1998-07-24     3107 days       2007-01-25
130 1990-04-02    1999-08-16     3423 days       2008-12-29
151 1991-01-29    1999-08-05     3110 days       2008-02-09
229 1990-04-13    1998-11-17     3140 days       2007-06-23
314 1990-03-07    1999-12-25     3580 days       2009-10-13
331 1990-09-18    1999-12-19     3379 days       2009-03-20
348 1990-02-27    1999-01-04     3233 days       2007-11-11
392 1990-12-24    1999-12-04     3267 days       2008-11-13
590 1990-03-25    1998-12-20     3192 days       2007-09-16
634 1991-04-04    1999-07-21     3030 days       2007-11-06
674 1990-03-16    1998-12-28     3209 days       2007-10-11
760 1990-09-16    1998-12-06     3003 days       2007-02-25
764 1990-09-19    1999-09-16     3284 days       2008-09-12
786 1990-10-26    1999-05-10     3118 days       2007-11-22
884 1990-01-20    1999-11-12     3583 days       2009-09-03
902 1991-07-03    1999-11-10     3052 days       2008-03-19
904 1990-02-13    1999-11-15     3562 days       2009-08-16
943 1991-01-30    1999-12-02     3228 days       2008-10-03

In [198]:
shipping[shipping["Delivery time"]<"365 days"]

    order_date delivery_date Delivery time Twice_As_long_As
ID
1   1998-05-24    1999-02-05      257 days       1999-10-20
8   1993-06-10    1993-11-11      154 days       1994-04-14
19  1998-05-10    1998-05-19        9 days       1998-05-28
30  1998-10-22    1999-01-11       81 days       1999-04-02
46  1995-09-05    1996-07-19      318 days       1997-06-02
58  1995-02-11    1995-04-16       64 days       1995-06-19
59  1995-09-29    1995-12-16       78 days       1996-03-03
68  1990-02-14    1990-06-26      132 days       1990-11-05
79  1992-06-11    1992-12-04      176 days       1993-05-29
88  1997-08-29    1997-09-19       21 days       1997-10-10
114 1990-04-02    1991-01-20      293 days       1991-11-09
122 1995-11-22    1996-07-31      252 days       1997-04-09
137 1997-04-02    1997-08-28      148 days       1998-01-23
159 1995-12-23    1996-12-19      362 days       1997-12-16
161 1991-10-30    1992-07-05      249 days       1993-03-11
163 1990-05-21    1991-04-01      315 days       1992-02-10
167 1993-11-30    1994-11-19      354 days       1995-11-08
182 1994-03-03    1994-06-03       92 days       1994-09-03
220 1990-04-19    1991-02-12      299 days       1991-12-08
226 1992-07-18    1993-06-09      326 days       1994-05-01
252 1991-01-28    1992-01-08      345 days       1992-12-18
277 1994-07-18    1994-10-06       80 days       1994-12-25
284 1993-10-10    1994-01-04       86 days       1994-03-31
298 1993-07-29    1994-01-17      172 days       1994-07-08
299 1992-08-17    1992-12-28      133 days       1993-05-10
303 1995-06-06    1995-08-15       70 days       1995-10-24
310 1997-09-20    1997-10-06       16 days       1997-10-22
311 1990-01-06    1990-02-06       31 days       1990-03-09
319 1990-11-30    1991-09-04      278 days       1992-06-08
337 1990-08-16    1991-02-10      178 days       1991-08-07
..         ...           ...           ...              ...
767 1991-04-23    1992-04-05      348 days       1993-03-19
770 1998-03-28    1998-06-05       69 days       1998-08-13
779 1995-05-25    1996-02-21      272 days       1996-11-19
781 1995-07-16    1995-08-17       32 days       1995-09-18
784 1997-04-08    1997-11-09      215 days       1998-06-12
791 1998-01-05    1998-09-01      239 days       1999-04-28
797 1996-08-05    1997-04-10      248 days       1997-12-14
819 1998-12-06    1999-07-31      237 days       2000-03-24
828 1991-08-09    1992-01-15      159 days       1992-06-22
834 1994-06-26    1994-09-28       94 days       1994-12-31
841 1991-08-04    1992-05-09      279 days       1993-02-12
843 1991-02-05    1991-05-06       90 days       1991-08-04
846 1997-03-13    1997-12-03      265 days       1998-08-25
851 1991-10-20    1992-08-26      311 days       1993-07-03
853 1991-06-29    1992-05-13      319 days       1993-03-28
861 1995-02-24    1995-10-17      235 days       1996-06-08
868 1991-02-12    1991-12-26      317 days       1992-11-07
873 1998-08-18    1998-10-05       48 days       1998-11-22
896 1990-08-23    1991-05-05      255 days       1992-01-15
898 1990-05-24    1990-06-01        8 days       1990-06-09
912 1992-08-21    1993-01-24      156 days       1993-06-29
932 1997-07-25    1998-04-09      258 days       1998-12-23
934 1995-05-22    1995-07-11       50 days       1995-08-30
939 1998-10-01    1998-12-07       67 days       1999-02-12
949 1991-10-07    1992-01-07       92 days       1992-04-08
954 1993-08-08    1994-01-23      168 days       1994-07-10
969 1996-09-24    1996-11-16       53 days       1997-01-08
975 1997-06-18    1997-11-02      137 days       1998-03-19
985 1995-07-26    1996-06-18      328 days       1997-05-12
994 1993-06-03    1993-06-13       10 days       1993-06-23

[107 rows x 4 columns]

In [203]:
shipping["Delivery time"].min() #shortest delivery time

Timedelta('8 days 00:00:00')

In [205]:
shipping["Delivery time"].max() #longest delivery time

Timedelta('3583 days 00:00:00')